# NewSpace Method (Level, Phase, UV) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..NewSpace Method (Level, Phase, UV)
Document Class See Also
---
Creates a new space element on the given level, at the given location, and assigned to the given phase.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Space NewSpace(
	Level level,
	Phase phase,
	UV point
)
```

Visual Basic
---
```text
Public Function NewSpace ( _
	level As Level, _
	phase As Phase, _
	point As UV _
) As Space
```

Visual C++
---
```text
public:
Space^ NewSpace(
	Level^ level,
	Phase^ phase,
	UV^ point
)
```

# ### Parameters
level
    Type: Autodesk.Revit.DB..::..Level The level on which the room is to exist.
phase
    Type: Autodesk.Revit.DB..::..Phase The phase in which the room is to exist.
point
    Type: Autodesk.Revit.DB..::..UV A 2D point that dictates the location on that specified level.
# ### Return Value
If successful a new Space element within the project, otherwise nullNothingnullptra null reference (Nothing in Visual Basic).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when level, phase or point is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the space cannot be created. |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown if the level does not exist in the given document. |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown if the phase does not exist in the given document. |

# See Also
Document Class
NewSpace Overload
Autodesk.Revit.Creation Namespace